/*Напишите метод, который отображает на экран форматированный текст, указанный ниже
        “Someone’s sitting in the shade today
        because someone planted a tree a long time ago.

 */

public class Main {
    public static void main(String[] args) {
        System.out.println(" \"Someone\'s sitting in the shade today \n because someone planted a tree a long time ago.\" \n Warren Buffet.");
    }
}